# Energy Analysis Opening Get Construction Method

Source: https://www.revitapidocs.com/2026/617b3b8e-ae52-4582-7c49-957fc70a9d14.htm

---

| Energy Analysis Opening Get Construction Method |
| --- |

Gets the analytic construction this opening is associated with. Null when this opening is a window.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public EnergyAnalysisConstruction GetConstruction()
```

```
Public Function GetConstruction As EnergyAnalysisConstruction
```

```
public:
EnergyAnalysisConstruction^ GetConstruction()
```

```
member GetConstruction : unit -> EnergyAnalysisConstruction
```

#### Return Value

EnergyAnalysisConstruction
The analytic construction. See Also

#### Reference

EnergyAnalysisOpening Class Autodesk.Revit.DB.Analysis Namespace